{"pageProps":{"frontMatter":{"title":"#1 Redirecting Dynamic URLs at Build Time in NextJS ... & Hello!","author":"William Grant","abstract":"Redirecting URLs","isPublished":true,"publishedOn":"2021-07-18"},"markdownBody":"\n# Hello there 👋\n\n<img src=\"https://i.kym-cdn.com/photos/images/original/001/475/420/c62.gif\" alt=\"obi-wan-kenobi-meme\" width=\"320\"/>\n\nThis is my first post of what I hope to be many in the future. Many developers tell us that blogging is a great tool for discussion, consolidation & reflection and I think that it's time to give it a shot!\n\nThe plan is to use my blog as a tool for many things going forward: writing about my time living in Japan and how it changed me for the better; my learnings and musings from my dev life which hopefully are useful to any aspiring developers out there; and finally, improving my writing and grammar (please feel free to rip me apart via email at <a href=\"mailto:hi@yougotwill.com?subject=Writing Issue on Blog #1\">hi@yougotwill.com</a>) because writing is a great tool to sharpen one's mind and my dad always said I had writing potential (this one's for you old man)! I'm sure that there will be many other things to talk about going forward and once I implement tags on my site, it will all be neatly sorted for your reading pleasure.\n\nNow on with the show! If you aren't interested in web development, specifically <a href=\"https://nextjs.org/\" target=\"_blank\">NextJS</a> this may be where we part ways for now. Don't fret though I'm sure there will be future posts that suit your <a href=\"https://www.youtube.com/watch?v=XVIMAc_U3Tc\" target=\"_blank\">flava</a> 😁.\n\n## Today's reflections\n\nSo, I have recently started working for a new company as a Front-End developer and have been grappling with various challenges **(read as learning opportunities)** as I settle myself in and truly learn how websites work and not just how to make them <a href=\"https://giphy.com/gifs/handsome-will-smith-men-in-black-jUr6ul7c26FYA/fullscreen\" target=\"_blank\">look good</a>.\n\nI'm about 2 weeks in and have learned so much already and I hope to break them down into various posts in the coming weeks (don't hold me to it). So anyway, today's challenge had to do with redirecting urls.\n\n**But Will**, what on Earth do you mean man? Don't urls already take you someplace why would they need redirecting? Well dear readers, it's quite simple really. Let's take the famous privacy messenger, Signal. We want to download Signal to better secure ourselves from the powers that be. How do we go about doing that? Easy of course! Head over to <a href=\"https://www.signal.org/download/\" target=\"_blank\">https://www.signal.org/download/</a> and pick your device. But aha says me! Dear reader, look, have you noticed the easy, one-click, solution to show your friends how to download Signal?\n\n<img src=\"/resources/blog/images/redirect-dynamic-urls-nextjs/png\" alt=\"signal website screenshot\" width=\"640\"/>\n\n// TODO\n"},"__N_SSG":true}